In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

In [106]:
df_train = pd.read_csv(r'C:/Users/silri/Desktop/Applied_AI/Assigments/titanic/train.csv')
df_test = pd.read_csv(r'C:/Users/silri/Desktop/Applied_AI/Assigments/titanic/test.csv')

In [107]:
df_train.shape

(891, 12)

In [108]:
df_test.shape

(418, 11)

In [109]:
#Create the entire dataframe

#df  = pd.concat([df_train,df_test])
df = df_train

In [110]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [111]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [112]:
#Droping the irrelevant columns those will not contribute to the model at all

#PassengerID, Name,Ticket,Cabin, Embarked

df.drop(columns=['PassengerId','Name','Ticket','Cabin','Embarked'],inplace=True,axis=1)

In [113]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [114]:
df_sex = pd.get_dummies(df['Sex'],drop_first=True)
df_sex.rename({'male':'Sex'},inplace=True,axis=1)
df_sex

     Sex
0      1
1      0
2      0
3      0
4      1
..   ...
886    1
887    0
888    0
889    1
890    1

[891 rows x 1 columns]

In [115]:
df.drop('Sex',axis=1,inplace = True)
df = pd.concat([df,df_sex],axis=1)
df.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  Sex
0         0       3  22.0      1      0   7.2500    1
1         1       1  38.0      1      0  71.2833    0
2         1       3  26.0      0      0   7.9250    0
3         1       1  35.0      1      0  53.1000    0
4         0       3  35.0      0      0   8.0500    1

In [116]:
df.columns

Index(['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Sex'], dtype='object')

In [117]:
#df.info()
df.isnull().sum()
# We can see the null values are available only in the Age section
#As a first-cut solution lets replace that by mean.

Survived      0
Pclass        0
Age         177
SibSp         0
Parch         0
Fare          0
Sex           0
dtype: int64

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Age       714 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Sex       891 non-null    uint8
dtypes: float64(2), int64(4), uint8(1)
memory usage: 42.8 KB

In [120]:
 from sklearn.impute import SimpleImputer

si = SimpleImputer(strategy='mean')
df_age = pd.DataFrame(si.fit_transform(pd.DataFrame(df['Age'])))

In [132]:
df.drop('Age',axis=1,inplace=True)

In [133]:
df = pd.concat([df,df_age],axis=1).rename({0:'Age'},axis=1)
df['Age'] = df['Age'].astype(int)
df

     Survived  Pclass  SibSp  Parch     Fare  Sex  Age
0           0       3      1      0   7.2500    1   22
1           1       1      1      0  71.2833    0   38
2           1       3      0      0   7.9250    0   26
3           1       1      1      0  53.1000    0   35
4           0       3      0      0   8.0500    1   35
..        ...     ...    ...    ...      ...  ...  ...
886         0       2      0      0  13.0000    1   27
887         1       1      0      0  30.0000    0   19
888         0       3      1      2  23.4500    0   29
889         1       1      0      0  30.0000    1   26
890         0       3      0      0   7.7500    1   32

[891 rows x 7 columns]

In [135]:
X = df.drop('Survived',axis=1)
y = df['Survived']

In [156]:
#Train Test split

X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=42)

In [157]:
#Train the model

logit = LogisticRegression(penalty='l2',C=1.0,random_state=42,solver='liblinear',max_iter=100)

logit.fit(X_train,y_train)

LogisticRegression(random_state=42, solver='liblinear')

In [158]:
y_pred = pd.DataFrame(logit.predict(X_test))

In [164]:
y_pred.rename({0:'survived_pred'},axis=1,inplace=True)

In [165]:
y_pred

     survived_pred
0                0
1                0
2                0
3                1
4                1
..             ...
174              0
175              0
176              0
177              1
178              1

[179 rows x 1 columns]

In [179]:
from sklearn.metrics import classification_report,confusion_matrix

In [180]:
print(classification_report(y_act, y_pred,labels=[0,1]))

              precision    recall  f1-score   support

           0       0.80      0.87      0.83       105
           1       0.78      0.69      0.73        74

    accuracy                           0.79       179
   macro avg       0.79      0.78      0.78       179
weighted avg       0.79      0.79      0.79       179

In [182]:
confusion_matrix(y_act, y_pred)

array([[91, 14],
       [23, 51]], dtype=int64)